[
    {
        "id" : 0,
        "title": " What is Context API",
        "dic": " The Context API works like a mobile network tower. This makes the job of prop drilling easier. There are three steps to follow to use context api. (1) createContext (2) Using a provider. and (3) useContext . First put createContext in a variable and set a default value. The variable should be exported. So that any component within that component can be used. Any value can be given with provider. But the value must be a single value. If multiple values need to be sent then an array of values must be given inside ",
        "pic": "https://bs-uploads.toptal.io/blackfish-uploads/components/seo/content/og_image_file/og_image/777655/react-context-api-4929b3703a1a7082d99b53eb1bbfc31f.png"
    },{
        "id" : 1,
       
        "title": " What is React router dom",
       
        "dic": " React Router is a standard library for routing in React. It enables the navigation among views of various components in a React Application, allows changing the browser URL, and keeps the UI in sync with the URL. Let us create a simple application to React to understand how the React Router works.The application will contain three components: home component about a component and contact component.We will use React Router to navigate between these components.Setting up the React Application: Create a React application using create - react - app and lets call it geeks.Note: If you’ ve previously installed create - react - app globally via npm directly use the command below",
      
        "pic": "https://crowdbotics.ghost.io/content/images/2019/07/react-router.jpg"
    }
    ,{
        "id" : 2,
       
        "title": " What is Redux",
       
        "dic": " Redux is a predictive status container for JavaScript applications. So what does that really mean? If we dig deeper into this statement, we see that Redux is a state management library that you can use with any JS library or framework like React, Angular, or Vue.",
      
        "pic": "https://chriscourses.com/img/blog/redux/redux.jpg"
    }
]